## plan for staging
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_ecs_service.api will be created
+   resource "aws_ecs_service" "api" {
+       cluster                            = "demo-ecs-staging-cluster"
+       deployment_maximum_percent         = 200
+       deployment_minimum_healthy_percent = 100
+       desired_count                      = 1
+       enable_ecs_managed_tags            = false
+       enable_execute_command             = false
+       iam_role                           = (known after apply)
+       id                                 = (known after apply)
+       launch_type                        = "FARGATE"
+       name                               = "demo-ecs-staging-api"
+       platform_version                   = "1.4.0"
+       scheduling_strategy                = "REPLICA"
+       tags_all                           = (known after apply)
+       task_definition                    = "demo-ecs-staging-api"
+       triggers                           = (known after apply)
+       wait_for_steady_state              = false

+       load_balancer {
+           container_name   = "proxy"
+           container_port   = 8000
+           target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:167259143853:targetgroup/demo-ecs-staging-api/ae760b6216a97de0"
        }

+       network_configuration {
+           assign_public_ip = false
+           security_groups  = [
+               "sg-0342d74729a81791d",
            ]
+           subnets          = [
+               "subnet-008a15e08b004259e",
+               "subnet-01a59b9d6fd294547",
            ]
        }
    }

  # aws_lb_listener.api will be created
+   resource "aws_lb_listener" "api" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       load_balancer_arn = "arn:aws:elasticloadbalancing:eu-west-1:167259143853:loadbalancer/app/demo-ecs-staging-main/b788ea8d24525e69"
+       port              = 80
+       protocol          = "HTTP"
+       ssl_policy        = (known after apply)
+       tags_all          = (known after apply)

+       default_action {
+           order            = (known after apply)
+           target_group_arn = "arn:aws:elasticloadbalancing:eu-west-1:167259143853:targetgroup/demo-ecs-staging-api/ae760b6216a97de0"
+           type             = "forward"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```